[
  {
    "title": "wstęp",
    "data": [
      {
        "type": "Text",
        "value": "Cala filozofia zadań z obwodami polega na wyznaczeniu równań prądowych, napięciowych i wyliczenia niewiadomych z takiego układu równań. Najczęściej po drodze należy wykorzystać jeszcze prawo Ohma. Tak więc przydadzą się oba prawa Kirchhoffa i znajomość algebry liniowej. Stosując napięciowe prawo Kirchhoffa ważna jest umiejętność określenia ile jest oczek na schemacie i gdzie one są, bo coś, co może na pierwszy rzut oka wyglądać jak oczko nie zawsze nim jest. Zasadą metody oczkowej jest to, że „nie widzi” ona fizycznych źródeł prądu. Wszystkie źródła prądowe w obwodzie elektrycznym musimy transformować do postaci „wirtualnych” źródeł napięcia. A mówiąc po ludzku, tam gdzie jest strzałka w podwójnym kółku, tam nie ma oczka. <br></br>Dla każdego z tych oczek rysujesz kierunek przepływu prądu. Nie ma znaczenia, w którą stronę to zaznaczysz. W jednym oczku może być zgodnie z ruchem wskazówek zegara, w drugim przeciwnie albo w obu może być tak samo."
      }
    ]
  },
  {
    "title": "zadanie z kolokwium",
    "data": [
      {
        "type": "Image",
        "value": "https://i.postimg.cc/qR7qMXTx/image.png",
        "props": { "orientation": "horizontal" }
      },
      {
        "type": "Text",
        "value": "Rysujemy kierunek przepływu prądu dla każdego z oczek (oczywiście są ich tu dokładnie dwa), zaznaczamy węzły A i B i określamy dla nich prądy wpływające i wypływające."
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/2jsWTMmp/oczko.png",
        "props": { "orientation": "horizontal" }
      },
      {
        "type": "Text",
        "value": "Do węzła A wpływa prąd i<sub>z1</sub>, a wypływają i<sub>1</sub>, i<sub>2</sub>, i<sub>4</sub>. Do węzła B wpływają prądy i<sub>2</sub>, i<sub>4</sub>, i<sub>z2</sub>, a wypływa i<sub>3</sub>. Na mocy pierwszego prawa Kirchhoffa:"
      },
      {
        "type": "Math",
        "value": "`i_{z1}-i_1-i_2-i_4=0`"
      },
      {
        "type": "Math",
        "value": "`i_{z2}+i_2+i_4-i_3=0`"
      },
      {
        "type": "Text",
        "value": "Teraz można podstawić liczby za i<sub>z1</sub> i i<sub>z2</sub>. Finalnie równania prądowe wygladają tak:"
      },
      {
        "type": "Math",
        "value": "`2-i_1-i_2-i_4=0`"
      },
      {
        "type": "Math",
        "value": "`5+i_2+i_4-i_3=0`"
      },
      {
        "type": "Text",
        "value": "Teraz korzystając z drugiego prawa Kirchhoffa zbudujemy kolejne dwa równania, odpowiednio dla górnego i dolnego oczka:"
      },
      {
        "type": "Math",
        "value": "`-e + U_{R2}-U_{R4}=0`"
      },
      {
        "type": "Math",
        "value": "`e - U_{R3}+U_{R1}-U_{R2}=0`"
      },
      {
        "type": "Text",
        "value": "Nie wiemy ile wynoszą napięcia oporników, ale znamy ich rezystancje i na podstawie prawa Ohma możemy napisać:"
      },
      {
        "type": "Math",
        "value": "`U_{R1}=i_1*R_1, U_{R2}=i_2*R_2, U_{R3}=i_3*R_3, U_{R4}=i_4*R_4`"
      },
      {
        "type": "Text",
        "value": "Po podstawieniu i<sub>n</sub>R<sub>n</sub> za U<sub>n</sub> oraz po wstawieniu znanych z treści zadania wartości liczbowych w miejsce R oraz e, nasze dwa równania napięciowe przybierają następującą postać:"
      },
      {
        "type": "Math",
        "value": "`-10 + 2i_2 - 4i_4 = 0`"
      },
      {
        "type": "Math",
        "value": "`10 - 3i_3 + i_1 - 2i_2 = 0`"
      },
      {
        "type": "Text",
        "value": "Razem z dwoma równaniami prądowymi tworzą układ czterech równań z czterema niewiadomymi i1, i2, i3 oraz i4. Rozwiązanie tego układu to już czysta matematyka, więc nie będę tego robił. Zapiszę tylko rozwiązanie. Jak wynik wyjdzie ujemny, to <b>nie</b> znaczy, że jest błędny."
      },
      {
        "type": "Math",
        "value": "`i_1=51/16; i_2=7/8; i_3 = 61/16; i_4 = -33/16`"
      },
      {
        "type": "Text",
        "value": "Pamiętaj, że bardziej skomplikowane układy równań możesz rozwiazać metodą wyznacznikową."
      }
    ]
  }
]
