[
  {
    "data": [
      {
        "type": "Text",
        "value": "<p>As you know how to run code it’s time to learn how to comment it.</p><p>Comments are essential for making your code more understandable and for leaving notes to yourself or other developers. In JavaScript, there are two ways to add comments:</p><p><b>1. Single-Line Comments</b>: Use // to add comments on a single line.</p>"
      },
      {
        "type": "Code",
        "value": "// console.log('Hello World')\n///// You can use more than two slashes",
        "props": { "language": "javascript" }
      },
      {
        "type": "Text",
        "value": "<b>2. Multi-Line Comments</b>: Enclose multi-line comments between /* and */"
      },
      {
        "type": "Code",
        "value": "/* \nconsole.log('Hello World') \n\n// you can nest single-line comments inside multi-line comments \n */\n\n/* multi-line comments, despite their name, can occupy just a single line.*/\n/*** you can use more than one star **/",
        "props": { "language": "javascript" }
      },
      {
        "type": "Text",
        "value": "<b>Why use comments?</b> <ul><li>Documentation: Comments provide information about the purpose and functionality of your code, making it easier for others (or yourself) to understand it.</li><li>Debugging: Comments can be used to temporarily disable lines of code for debugging purposes without deleting them.</li></ul>"
      },
      {
        "type": "Text",
        "value": "<b>Best practices</b> <ul><li>Be Clear and Concise: Write comments that are easy to understand. Avoid unnecessary comments that simply restate the code.</li><li>Regularly update Comments: Keep your comments up to date. If you change the code, make sure to update any relevant comments.</li><li>Avoid Over-Commenting: While comments are helpful, code should ideally be self-explanatory. Avoid overusing comments for simple and obvious code.</li></ul>"
      },
      {
        "type": "Header",
        "value": "JSDoc",
        "props": { "size": "md" }
      },
      {
        "type": "Text",
        "value": "JSDoc is a popular format for commenting code in many languages, which allows for the generation of documentation for source code. Using JSDoc helps maintain code clarity, document functions, parameters, return values, and other code elements. With JSDoc, documentation generation tools can automatically create detailed and readable documents."
      },
      {
        "type": "Code",
        "value": "/**\n* Returns the sum of two numbers .\n*\n* @param {number} a - The first number.\n* @param {number} b - the second number.\n* @returns {number} - The sum of a and b.\n*/\n function add(a, b) {\n \t\t  return a + b;\n } ",
        "props": { "language": "javascript" }
      },
      {
        "type": "Text",
        "value": "Now that you've grasped the basics of commenting, you'll find it beneficial for enhancing the readability and maintainability of your code"
      },
      {
        "type": "Block",
        "value": [
          {
            "type": "Text",
            "value": "You can enhance you comments when you install VS Code extension called 'Better Comments'"
          },
          {
            "type": "Image",
            "value": "https://i.postimg.cc/zBqg1Q1T/image.png"
          }
        ],
        "props": {
          "type": "tip"
        }
      }
    ]
  }
]
