[
  {
    "title": "",
    "data": [
      {
        "type": "Block",
        "value": [
          {
            "type": "Text",
            "value": "Jak gdzieś tu się pojawi <s>przekreślony tekst</s> to znaczy że ta kreska powinna być u góry, a nie przekreślać napisu. Z jakiegoś powodu kreska nad tekstem się nie pojawia, więc muszę to zapisać w inny sposób."
          }
        ],
        "props": {
          "type": "info"
        }
      }
    ]
  },
  {
    "title": "kod pierścieniowy, definicje",
    "data": [
      {
        "type": "Text",
        "value": "<b>Kod pierścieniowy (1 z N)</b> - kod, w którym jedynka przypisywana jest tylko wadze liczby, której odpowiada kod dziesiętny. Słowa binarne o długości n bitów zawierają zawsze tylko jeden bit o wartości 1. Pozycja jedynki determinuje zakodowaną wartość; jest to więc kod pozycyjny, bezwagowy."
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/dtLfmM52/image.png",
        "props": { "description": "kod 1 z N" }
      },
      {
        "type": "Text",
        "value": "<b>Kod <s>1 z N</s></b> - to samo co 1 z N, ale zamieniasz miejscami zera z jedynkami."
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/VNcH8Jmg/image.png",
        "props": { "orientation": "horizontal" }
      },
      {
        "type": "Text",
        "value": "<b>Dekoder</b> - układ zamieniający kod wewnętrzny inny niż pierścieniowy na pierścieniowy."
      },
      {
        "type": "Text",
        "value": "<b>Enkoder</b> - narzędzie służące do zamiany jednego kodu w inny  kod. Jako narzędzie należy rozumieć program, układ scalony, urządzenie mechaniczne itp."
      },
      {
        "type": "Text",
        "value": "<b>Enkoder priorytetowy</b> - jeśli na wyjściu pojawi się więcej niż jeden sygnał wyróżniony, to ustalona ranga priorytetów wejścia decyduje, który z nich otrzymuje wyższy priorytet - który z nich zostanie 'wybrany'."
      },
      {
        "type": "Text",
        "value": "<b>Transkoder</b> - układ umożliwiający współpracę systemów cyfrowych pracujących na innych kodach wewnętrznych, czyli układ zamieniający jeden kod wewnętrzny na inny, z których żaden nie jest kodem pierścieniowym."
      }
    ]
  },
  {
    "title": "układ 7442",
    "data": [
      {
        "type": "Text",
        "value": "7442 - dekoder kodu naturalnego BCD na kod <s>1 z 10</s>. Składa się z ośmiu inwerterów NOT i 10 czterowejściowych bramek NAND. Inwertery pracują w parach, aby dostarczyć odpowiednich sygnałów sterujących dla bramek wyjściowych. Wewnątrz układu wykonywane jest pełne dekodowanie, co zapewnia stan nieaktywny wyjść w przypadku nieprawidłowych stanów wejściowych. Dekoder posiada cztery wejścia oznaczone A, B, C i D oraz 10 wyjść od 0 do 9.<br></br>Na wejścia podajemy cyfrę w kodzie BCD (ang. Binary Coded Decimal, kod dziesiętny kodowany dwójkowo). Powoduje to wysterowanie odpowiedniego wyjścia od 0 do 9 w stan niski, jeśli kod wejściowy jest poprawny. W przeciwnym razie wyjścia pozostają w stanie wysokim. <a href='https://eduinf.waw.pl/inf/prg/010_uc/7442.php'>źródło</a> <br></br> Spełnia funkcje np. dekodera trzybitowego kodu dwójkowego na kod 1 z 8 lub demultipleksera z jednego wejścia na jedno z ośmiu wyjść; do konwersji naturalnego czterobitowego kodu dwójkowego na kod 1 z 16."
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/HkYSLffD/image.png",
        "props": { "description": "symbol 7442", "orientation": "landscape" }
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/P554H1wd/image.png",
        "props": { "description": "obudowa 7442", "orientation": "landscape" }
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/7LCnGD9c/image.png",
        "props": {
          "description": "tabela stanów 7442",
          "orientation": "vertical"
        }
      }
    ]
  },
  {
    "title": "układ 74147",
    "data": [
      {
        "type": "Text",
        "value": "Układ 74147 to enkoder priorytetowy 9 linii na 4 (ang. 9-Line to 4-Line Priority Encoder). Posiada 9 wejść od 1 do 9 oraz 4 wyjścia A, B, C i D. Stanem aktywnym wejść i wyjść jest poziom logiczny 0. Układ działa w ten sposób, iż badany jest stan poszczególnych bitów od 9 do 1. Jeśli zostanie napotkany pierwszy stan 0 na bicie n-tym, to na wyjściach pojawia się binarnie numer n w stanie zanegowanym (tzn. np. dla n = 7 będzie 1000). Dziesiąty stan występuje wtedy, gdy wszystkie wejścia są w stanie wysokim 1. <a href='https://eduinf.waw.pl/inf/prg/010_uc/74147.php'>źródło</a>"
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/B6qCNyGc/image.png",
        "props": { "description": "symbol 74147" }
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/qRjxFLJf/image.png",
        "props": { "description": "obudowa DIL-16", "orientation": "horizontal" }
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/x8Zyf1Nt/image.png",
        "props": { "description": "tabela stanów dekodera typu 74147", "orientation": "portrait" }
      }
    ]
  },
  {
    "title": "kody",
    "data": [

      {
        "type": "Header",
        "value": "Kody wagowe i niewagowe",
        "props": { "size": "sm" }
      },
      {
        "type": "Text",
        "value": "W przypadku dwójkowych kodów wagowych (pozycyjnych), każdy bit (każda pozycja) słowa kodowego ma określoną wagę (np. naturalny kod binarny). Wagi są liczbami całkowitymi i mogą przyjmować wartości ujemne. Wartości liczbowe kodów są wyznaczane jako sumy wag tych pozycji słów kodowych, które zawierają jedynki. W kodach niewagowych nie ma bezpośredniej zależności między pozycją cyfry a jej wagą. Słowa kodowe są tworzone według z góry zadanych reguł (np. kod Graya). <a href='http://staff.iiar.pwr.wroc.pl/robert.wojcik/dydaktyka/cop/ipi/ipi_cw2.pdf'>Więcej info (pdf)</a>"
      },

      {
        "type": "Text",
        "value": "<b>NKB</b> (naturalny kod binarny) - zapis liczby nieujemnej w naturalnym kodzie binarnym odpowiada jej reprezentacji w pozycyjnym kodzie dwójkowym. Wagi NKB k-pozycyjnego są równe 2^i gdzie i={0, 1, 2, ..., k}. Np. za pomocą kodu 3-bitowego można zakodowac 8 kolejnych wartości 0, 1, 2, 3, 4, 5, 6, 7. Waga pozycji 0 wynosi 1, waga pozycji 1 równa się 2, natomiast waga pozycji 2 wynosi 4."
      },
      {
        "type": "Header",
        "value": "Zamiana z systemu binarnego na dziesiętny i vice versa",
        "props": { "size": "sm" }
      },
      {
        "type": "YouTube",
        "value": "64bXbK104qk"
      },
      {
        "type": "Text",
        "value": "<b>Kod BCD</b> - stosowany w elektronice i informatyce sposób zapisu liczb polegający na zakodowaniu kolejnych cyfr dziesiętnych liczby dwójkowo przy użyciu czterech bitów. Taki zapis pozwala na łatwą konwersję liczby do i z systemu dziesiętnego, jest jednak nadmiarowy (wykorzystuje tylko 10 czterobitowych układów z 16 możliwych). Np.: liczba 127 przedstawiona w BCD to: 0001 0010 0111. <br></br>BCD jest powszechnie stosowany w systemach cyfrowych wymagających precyzyjnej arytmetyki dziesiętnej, takich jak kalkulatory, kasy fiskalne i systemy księgowe. Znajduje również zastosowanie w obwodach zegara czasu rzeczywistego i systemach pomiarowych. <a href='https://www.lenovo.com/us/en/glossary/binary-coded-decimal/#:~:text=BCD%20is%20commonly%20used%20in,clock%20circuits%20and%20measurement%20systems.'>źródło</a>"
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/9fJPn0Mr/image.png",
        "props": { "description": "kod BCD", "orientation": "vertical" }
      },
      {
        "type": "Text",
        "value": "<b>Kod Aikena</b> -  kod, w którym cyfry dziesiętne występują z jednakowym prawdopodobieństwem. Poszczególne cyfry dziesiętne przedstawione są za pomocą ciągów bitowych o jednakowej długości. Długość słowa kodowego wynosi 4 bity (należy zakodować 10 cyfr dziesiętnych). <br></br>Kod Aikena nazywany jest tez kodem 2421, bo takie są w nim wagi. Np. cyfra 7 zakodowama w nim to 1101, bo 1*2 + 1*4 + 0*2 + 1*1 = 7. Charakterystyczne jest w nim to, że pierwsze pięć cyfr dziesiętnych (0-4) i ostatnie pięć (5-9) mają zamienione zera na jedynki i vice versa. 0 to 0000, 9 to 1111. 1 to 0001, 8 to 1110 . 2 to 0010, 7 to 1101 itd. "
      },
      {
        "type": "Image",
        "value": "https://i.postimg.cc/MZhLDPNg/image.png",
        "props": { "description": "kod Aikena", "orientation": "vertical" }
      }
    ]
  }
]
