[
  {
    "title": "pojęcia",
    "data": [
      {
        "type": "Text",
        "value": "<b>Licznik</b> to układ cyfrowy sekwencyjny (stan wyjść y zależy od stanu wejść x oraz od poprzedniego stanu, zwanego stanem wewnętrznym, pamiętanego w zespole rejestrów – pamięci), służący do zliczania i pamiętania liczby impulsów podawanych na jego wejście zliczające. Oprócz wejścia dla impulsów zliczanych, licznik ma zazwyczaj wejście ustawiające jego stan początkowy. Ustawienie wszystkich przerzutników, z których zbudowany jest licznik, w stan 0 nazywa się zerowaniem licznika. Podstawowym elementem liczników jest przerzutnik synchroniczny. Liczba wyjść (długość licznika) jest równa liczbie przerzutników. Stan licznika to określona kombinacja stanów przerzutników, budujących licznik. <br></br> <b>Liczniki dodające</b> – po każdym impulsie wejściowym zwiększają liczbę pamiętaną o 1.<br></br><b>Liczniki odejmujące</b> – zmniejszają o 1 zawartość licznika. <br></br> <b>Liczniki rewersyjne</b> – dwukierunkowe. Dodają i odejmują impulsy w jednym liczniku. <br></br> <b>Licznik modulo N</b> – przechodzi przez wszystkie stany cyklicznie (po przejściu N stanów cykl jest powtarzany).<br></br><b>Licznik do N</b> – przechodzi przez wszystkie stany jednokrotnie (po osiągnięciu ostatniego pozostaje w nim). Ponowne użycie licznika wymaga wyzerowania go.<br></br><b>Licznik asynchroniczny</b> – wyjście jednego przerzutnika jest źródłem sygnału zegarowego (wejściowego) dla kolejnego przerzutnika. Zliczane impulsy są podawane tylko do jednego przerzutnika. <br></br><b>Licznik synchroniczny</b> – sygnał zegarowy jest doprowadzony jednocześnie do wejść synchronizujących wszystkich przerzutników. Pojawienie się kolejnego impulsu zliczanego sprawia, że wszystkie przerzutniki jednocześnie przetwarzają informację wejściową i czas ustalania się kolejnego stanu licznika wyznacza przerzutnik o najdłuższym czasie propagacji."
      }
    ]
  },
  {
    "title": "licznik 7490",
    "data": [
      {
        "type": "Image",
        "value": "https://i.postimg.cc/m23sKb1v/image.png"
      },
      {
        "type": "Text",
        "value": "Układ 7490 <u>składa się z dwóch niezależnych modułów (liczników) liczących odpowiednio mod 2 i mod 5</u>. Wejście zegarowe A dotyczy modułu liczącego do 2, wejście zegarowe B dotyczy modułu liczącego do 5. Wynik z modułu 2 pojawia się na wyjściu QA, wynik z modułu 5 pojawia się na pozostałych wyjściach QB, QC i QD. Zliczanie odbywa się przy opadającym zboczu sygnału zegarowego. Dodatkowo licznik posiada dwa wejścia zerujące R0(1) i R0(2) (stan wysoki na obu tych wejściach powoduje wyzerowanie licznika) oraz dwa wejścia ustawiające R9(1) i R9(2) (stan wysoki na obu wejściach powoduje ustawienie stanu 9 na wyjściach licznika: QA = QD = 1, QB = QC = 0)."
      },
      {
        "type": "Text",
        "value": "Więcej info: <a href='https://www.eduinf.waw.pl/inf/prg/010_uc/7490.php'>LINK</a>"
      }
    ]
  },
  {
    "title": "licznik 74193",
    "data": [
      {
        "type": "Image",
        "value": "https://i.postimg.cc/9fk5y0s7/image.png"
      },
      {
        "type": "Text",
        "value": "Układ 74193 zawiera synchroniczny, rewersyjny licznik dwójkowy (4 bity) z dwoma wejściami zegarowymi i z wejściem zerującym (ang. Synchronous Up/Down Binary 4-bit Counter with Dual Clock and Clear). Wyjścia licznika zmieniają stany synchronicznie w takt impulsów zegarowych. Znaczenie wejść/wyjść układu jest następujące:<br></br><b>UP</b> - dodatnie zbocze sygnału na tym wejściu powoduje zwiększanie stanu licznika o 1. Licznik zlicza w górę.<br></br><b>DOWN</b> - dodatnie zbocze sygnału na tym wejściu powoduje zmniejszenie stanu licznika o 1. Licznik zlicza w dół.<br></br><b>CLR</b> - stan 1 powoduje wyzerowanie stanu licznika. Funkcja ta jest niezależna od stanu pozostałych wejść.<br></br><b>LOAD</b> - stan niski 0 powoduje przepisanie danych z wejść A...D na wyjścia QA...QD niezależnie od sygnałów zegarowych.<br></br><b>A...D</b> - wejścia danych.<br></br><b>CO</b> - wyjście przeniesienia do następnej dekady liczącej. Na wyjściu tym pojawia się ujemny impuls o czasie trwania impulsu na wejściu UP, gdy licznik zmienia swój stan z 15 na 0.<br></br><b>BO</b> - wyjście pożyczki do następnej dekady liczącej. Na wyjściu tym pojawia się ujemny impuls o czasie trwania impulsu na wejściu DOWN, gdy licznik zmienia swój stan z 0 na 15.<br></br><b>AQ...QD</b> - wyjścia stanu licznika w kodzie 8421."
      },
      {
        "type": "Text",
        "value": "Więcej info: <a href='https://eduinf.waw.pl/inf/prg/010_uc/74193.php'>LINK</a>"
      }
    ]
  },
  {
    "title": "projektowanie liczników mod N",
    "data": [
      {
        "type": "Text",
        "value": ":("
      }
    ]
  }
]
